# TwoPointsSelectedBeforeEdit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MechanicalFailures..::..TwoPointsSelectedBeforeEdit Property
BuiltInFailures..::..MechanicalFailures Class See Also
---
Two points have to be selected before existing the edit mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TwoPointsSelectedBeforeEdit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TwoPointsSelectedBeforeEdit As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TwoPointsSelectedBeforeEdit {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MechanicalFailures Class
Autodesk.Revit.DB Namespace